########################################################################################################################
"""

## Задание 4. JSON-строка

Дан словарь:

```python
user = {
    "name": "Анна",
    "age": 25,
    "city": "Казань",
    "active": True
}
```

С помощью `json.dumps()` преобразуйте словарь в JSON-строку.

После этого с помощью `json.loads()` преобразуйте строку обратно в Python-объект.

Выведите:

* JSON-строку;
* имя пользователя;
* город.

Русские символы должны сохраняться в читаемом виде.

### Пример результата

```text
{
    "name": "Анна",
    "age": 25,
    "city": "Казань",
    "active": true
}

Анна
Казань
```

---
"""
########################################################################################################################

import json

user = {
    "name": "Анна",
    "age": 25,
    "city": "Казань",
    "active": True
}

json_str = json.dumps(user, ensure_ascii=False)

print(json_str)

user1 = json.loads(json_str)

print(user1["name"])
print(user1["city"])