
"""


```python
np.int16
```

Выведите:

* массив;
* количество измерений;
* форму;
* количество элементов;
* тип данных;
* размер одного элемента в байтах;
* общий объём массива в байтах.

### Пример результата

```text
[120 180 240 300 360]
Измерений: 1
Форма: (5,)
Элементов: 5
Тип: int16
Размер элемента: 2
Размер массива: 10
```

---

"""

import numpy as np

a = np.array([120, 180, 240, 300, 360], dtype=np.int16)
print(a)
print(f"Измерений: {a.ndim}")
print(f"Форма: {a.shape}")
print(f"Элементов: {a.size}")
print(f"Тип: {a.dtype}")
print(f"Размер элемента: {a.itemsize}")
print(f"Размер массива: {a.nbytes}")