"""

# Задание 2. Резерв товара

Средствами NumPy создайте два массива по `6` элементов:

* первый состоит из нулей;
* второй состоит из единиц.

Тип данных:

```python
np.int16
```

Получите из второго массива:

```text
[5 5 5 5 5 5]
```

После этого сложите его с массивом нулей.

Массивы нельзя создавать ручным перечислением элементов.

### Пример результата

```text
Нули:
[0 0 0 0 0 0]

Резерв:
[5 5 5 5 5 5]

Результат:
[5 5 5 5 5 5]
```
---

"""

import numpy as np

a = np.zeros(6, dtype=np.int16)
b = np.ones(6, dtype=np.int16)
c = b*5

print(f"Нули:\n{a}")
print(f"Резерв:\n{c}")
print(f"Результат:\n{c + a}")