"""

# Задание 4. Расширение массива

Дан массив:

```python
data = np.array([5, 10, 15])
```

Средствами NumPy получите массив из `12` элементов:

```text
[ 5 10 15  5 10 15  5 10 15  5 10 15]
```

Не записывайте эти `12` элементов вручную.

После этого преобразуйте данные в таблицу:

```text
3 × 4
```

Выведите:

* всю таблицу;
* вторую строку;
* третий столбец;
* последний элемент.

Для получения отдельных частей массива используйте индексацию NumPy.

### Пример результата

```text
[[ 5 10 15  5]
 [10 15  5 10]
 [15  5 10 15]]

Вторая строка:
[10 15  5 10]

Третий столбец:
[15  5 10]

Последний элемент:
15
```

---
"""

import numpy as np

data = np.array([5, 10, 15])

data1 = np.resize(data, 12)
print(data1)
print(data1.reshape(3, 4))
print(data1.reshape(3, 4)[1])
print(data1.reshape(3, 4)[2, 3])