"""

# Задание 5. Выбор данных из таблицы

Дана матрица:

```python
data = np.array([
    [11, 12, 13, 14, 15],
    [21, 22, 23, 24, 25],
    [31, 32, 33, 34, 35],
    [41, 42, 43, 44, 45]
])
```

Не создавая новые массивы вручную, получите из исходной матрицы:

1. элементы со второго по четвёртый столбец первых трёх строк;
2. каждый второй столбец всей таблицы;
3. строки таблицы в обратном порядке.

Используйте индексацию и срезы NumPy.

### Пример результата

```text
Фрагмент:
[[12 13 14]
 [22 23 24]
 [32 33 34]]

Каждый второй столбец:
[[11 13 15]
 [21 23 25]
 [31 33 35]
 [41 43 45]]

Строки в обратном порядке:
[[41 42 43 44 45]
 [31 32 33 34 35]
 [21 22 23 24 25]
 [11 12 13 14 15]]
```

---
"""

import numpy as np

data = np.array([
    [11, 12, 13, 14, 15],
    [21, 22, 23, 24, 25],
    [31, 32, 33, 34, 35],
    [41, 42, 43, 44, 45]
])

print("Фрагмент:")
print(data[0:3, 1:4])

print("Каждый второй столбец:")
print(data[:, ::2])

print("Строки в обратном порядке:")
print(data[::-1])