"""

## Задание 7 ⭐. Анализ недели

Дан одномерный массив:

```python
data = np.array([
    12, 15, 9, 14,
    20, 18, 22, 16,
    7, 11, 10, 9,
    25, 20, 18, 22,
    14, 13, 17, 15,
    30, 28, 26, 24,
    9, 12, 8, 11
])
```

Это данные за `7` дней.

Для каждого дня записано по `4` значения.

Средствами NumPy:

1. представьте данные в виде таблицы `7 × 4`;
2. посчитайте сумму каждого дня;
3. посчитайте сумму каждой из четырёх позиций;
4. найдите максимальное значение каждого дня;
5. найдите минимальное значение каждой позиции;
6. получите первые два значения последних трёх дней.

Не используйте циклы и стандартные Python-функции `sum()`, `min()`, `max()`.

### Пример результата

```text
Суммы по дням:
[ 50  76  37  85  59 108  40]

Суммы столбцов:
[117 117 110 111]

Максимумы по дням:
[15 22 11 25 17 30 12]

Минимумы столбцов:
[ 7 11  8  9]

Последние три дня, первые два значения:
[[14 13]
 [30 28]
 [ 9 12]]
```

---
"""


import numpy as np

data = np.array([
    12, 15, 9, 14,
    20, 18, 22, 16,
    7, 11, 10, 9,
    25, 20, 18, 22,
    14, 13, 17, 15,
    30, 28, 26, 24,
    9, 12, 8, 11
])

data1 = data.reshape(7, 4)
print(data1)
print("Cуммы по дням:")
print(data1.sum(axis=1))
print("Cуммы столбцов:")
print(data1.sum(axis=0))
print("Максимумы по дням:")
print(data1.max(axis=1))
print("Минимумы столбцов:")
print(data1.min(axis=0))
print("Последние три дня, первые два значения:")
print(data1[-3:, :2])