"""

## Задание 8 ⭐. Трёхмерный склад

Средствами NumPy сформируйте последовательность чисел:

```text
1, 2, 3, ..., 24
```

Не записывайте числа вручную.

Преобразуйте полученные данные в трёхмерный массив:

```text
2 × 3 × 4
```

Считайте, что:

* первое измерение — склады;
* второе — стеллажи;
* третье — товары.

Не используя циклы:

1. получите второй склад;
2. посчитайте сумму каждого его стеллажа;
3. найдите максимальные значения каждого столбца первого склада;
4. получите из второго склада второй и третий столбцы;
5. создайте независимую копию этого фрагмента;
6. увеличьте значения копии в `10` раз.

После изменения копии исходный трёхмерный массив должен остаться без изменений.

### Пример результата

```text
Второй склад:
[[13 14 15 16]
 [17 18 19 20]
 [21 22 23 24]]

Суммы стеллажей:
[58 74 90]

Максимумы первого склада:
[ 9 10 11 12]

Изменённая копия:
[[140 150]
 [180 190]
 [220 230]]
```

---
"""


import numpy as np

data = np.arange(1, 25)

data1 = data.reshape(2, 3, 4)

print('второй склад:')
print(data1[1])

print('Суммы стеллажей:')
print(data1[1].sum(axis=1))

print('Максимумы первого склада')
print(data1[0].max(axis=0))

print('Изменённая копия')

data2 = data1[1][:, 1:3].copy()
data2 *= 10
print(data2)
