


########################################################################################################################
"""
## Задание 8 ⭐. Анализ журнала событий

Дан список:

```python
logs = [
    "2026-09-10 10:15:00 | 200",
    "2026-09-10 10:18:30 | 500",
    "2026-09-10 10:20:00 | 404",
    "2026-09-10 10:32:10 | 200"
]
```

Используя `re` и `datetime`:

1. извлеките дату и время каждой записи;
2. извлеките код статуса;
3. посчитайте количество ошибок — статус `400` и выше;
4. определите время между первой и последней записью списка.

### Результат

```text
Ошибок: 2
Период: 0:17:10
```

---
"""
########################################################################################################################

import re
from datetime import datetime


logs = [
    "2026-09-10 10:15:00 | 200",
    "2026-09-10 10:18:30 | 500",
    "2026-09-10 10:20:00 | 404",
    "2026-09-10 10:32:10 | 200"
]

def analyze_logs(logs):
    errors = 0
    start_time = None
    end_time = None
    for log in logs:
        ts = re.search(r"(\d{4}-\d{2}-\d{2} \d{2}:\d{2}:\d{2}) \| (\d*)", log)
        if ts.group(2) >= "400":
            errors += 1
        if start_time is None:
            start_time = datetime.strptime(ts.group(1), "%Y-%m-%d %H:%M:%S")
        end_time = datetime.strptime(ts.group(1), "%Y-%m-%d %H:%M:%S")    
    print(f"Ошибок: {errors}")
    print(f"Период: {end_time - start_time}")

analyze_logs(logs)